

PUAN_CONST = {'greeting': """สะวีดัส หยวนนักพอด แมวล้า เพิ่มเพื่อน @puan_bot แล้วพิมพ์ #ยอดนักผวน 
                        \n ยอดนักผวนตอบเฉพาะคนที่เพิ่มเป็นเพื่อนน้า  * บอทนี้จัดทำเพื่อความบันเทิงเท่านั้น *""",
              'how_to': """ยอดนักผวน  ถนัดผวนสองพยางค์ และใช้ได้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n ยอดนักผวนจะผวน พยางค์ที่สองและสุดท้ายเป็นหลัก: มะนาวต่างดุ๊ด >> มะนุดต่างดาว
                        \n ถ้าต้องการให้ผวนพยางค์แรกและพยางค์สุดท้าย ให้ใส่ @ไว้ที่หน้าพยางค์แรก: @ใตหาหัวจาม >> ตามหาหัวใจ
                        \n การเว้นวรรคระหว่างคำ/พยางค์ ช่วยให้ผวนเก่งขึ้น: @คัก น่า รน >> คนน่ารัก
                        \n ยอดนักผวนตอบเฉพาะคนที่แอดเป็นเพื่อนกันนะ กดที่ profile แล้วเพิ่มเพื่อน ได้เลย
                        \n หากเบื่อ นักผวน พิมพ์ #ออกไปเลยชิ่วๆ
                        """
              }

PUN_CONST = {'greeting': 'สวัสดี ดี่ ดี้ ดี๊ ดี ยอดนักผัน มาแลว แหล่ว แล่ว แล้ว แหลว เพิ่มเพื่อน @pun_bot แล้วพิมพ์ #ยอดนักผัน',
             'how_to': """ยอดนักผัน จะคอยผันทุกคำให้ และใช้ได้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n สะ หวัส ดี   : เว้นวรรคระหว่างคำ/พยางค์  ช่วยให้นักผันเก่งขึ้น
                        """

             }

LU_CONST = {'greeting': 'หละสุหลัสหวูสลีดู ลอดยูดลักนูกซูลี ลามูแซ้วลู้ว เพิ่มเพื่อน @lu_bot แล้วพิมพ์ #ยอดนักลู ',
            'how_to': """ยอดนักลู แปลงภาษาไทยเป็นภาษาลู และใช้ได้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n สะ หวัส ดี   : เว้นวรรคระหว่างคำ/พยางค์  ช่วยให้นักลูเก่งขึ้น
                        
                        \n ยอดนักลูตอบเฉพาะคนที่แอดเป็นเพื่อนกันนะ กดที่ profile แล้วเพิ่มเพื่อน ได้เลย
                        """
            }

ALL_CONST = {'puan': PUAN_CONST,
             'pun': PUN_CONST,
             'lu': LU_CONST}
