

PUAN_CONST = {'greeting': 'สะวีดัส หยวนนักพอด แมวล้า',
              'how_to': """ยอดนักผวน เก่งที่สองคำ และผวนกับตัวอักษรภาษาไทยเท่านั้น 
                        \n มะนาวต่างดุ๊ด : 3 คำขึ้นไป นักผวนจะผวน พยางค์ที่สองและสุดท้าย
                        \n @ไตหาหัวจาม : พิมพ์ @คำที่จะผวน เพื่อ ผวน พยางค์แรกและสุดท้าย 
                        \n คัก น่า รน   : เว้นวรรคระหว่างคำ/พยางค์ ช่วยให้นักผวนเก่งขึ้น
                        """
              }

PUN_CONST = {'greeting': 'สวัสดี ยอดนักผัน มาแล้ว',
             'how_to': """ยอดนักผัน ใช้กับตัวอักษรภาษาไทยเท่านั้น 
                        """

             }

LU_CONST = {'greeting': 'สวัสดี ยอดนักลู มาแล้ว',
            'how_to': """ยอดนักลู ใช้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n สะ หวัส ดี   : เว้นวรรคระหว่างคำ/พยางค์  ช่วยให้นักผวนเก่งขึ้น
                        """
            }

ALL_CONST = {'puan': PUAN_CONST,
             'pun': PUN_CONST,
             'lu': LU_CONST}
