

PUAN_CONST = {'greeting': 'สะวีดัส หยวนนักพอด แมวล้า แอดเราเป็นเพื่อน พิมพ์ #ยอดนักผวน',
              'how_to': """ยอดนักผวน  ผวนเก่งที่สองพยางค์ และใช้ได้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n มะนาวต่างดุ๊ด : 3 คำขึ้นไป นักผวนจะผวน พยางค์ที่สองและสุดท้าย
                        \n @ไตหาหัวจาม : พิมพ์ @คำที่จะผวน เพื่อ ผวน พยางค์แรกและสุดท้าย 
                        \n คัก น่า รน   : เว้นวรรคระหว่างคำ/พยางค์ ช่วยให้นักผวนเก่งขึ้น
                        """
              }

PUN_CONST = {'greeting': 'สวัสดี ดี่ ดี้ ดี๊ ดี ยอดนักผัน มาแลว แหล่ว แล่ว แล้ว แหลว แอดเราเป็นเพื่อน พิมพ์ #ยอดนักผัน',
             'how_to': """ยอดนักผัน จะคอยผันทุกคำให้ และใช้ได้กับตัวอักษรภาษาไทยเท่านั้น 
                        \n สะ หวัส ดี   : เว้นวรรคระหว่างคำ/พยางค์  ช่วยให้นักผันเก่งขึ้น
                        """

             }

LU_CONST = {'greeting': 'หละสุหลัสหวูสลีดู ลอดยูดลักนูกซูลี ลามูแซ้วลู้ว แอดเราเป็นเพื่อน พิมพ์ #ยอดนักลู ',
            'how_to': """ยอดนักลู จะแปลงภาษาไทยเป็นภาษาลู และใช้ได้กับตัวอักษรภาษาไทยยเท่านั้น 
                        \n สะ หวัส ดี   : เว้นวรรคระหว่างคำ/พยางค์  ช่วยให้นักผวนเก่งขึ้น
                        """
            }

ALL_CONST = {'puan': PUAN_CONST,
             'pun': PUN_CONST,
             'lu': LU_CONST}
